Tekla.Structures.Model.Internal.BimModelDataProduct.Types.VersionBranchState
Represents the state of the branch for a model version.

Tekla.Structures.Model.Internal.BimModelDataProduct.Types.VersionBranchState.Undetermined
The branch state of the version is unknown or not specified.

Tekla.Structures.Model.Internal.BimModelDataProduct.Types.VersionBranchState.Main
The version is on the main branch.

Tekla.Structures.Model.Internal.BimModelDataProduct.Types.VersionBranchState.Detached
The version is on a detached branch.